[HoloTargeting X2AbilityTemplate]
LocFriendlyName="标记射击"
LocLongDescription="任何指定<Ability:WeaponName/>射击,无论命中或丢失,将标记目标,增加你的队伍针对这个目标的命中率+<Ability:HOLOTARGETAIMBONUS/>."
LocHelpText="向一个目标射击可以给后续射击该目标的队友命中率加成"
LocPromotionPopupText="<Bullet/>指定<Ability:WeaponName/>-将给予全息定位.<br/><Bullet/>任何<Ability:ClassName/>针对多个单位的技能不会给予全息瞄准.<br/>"
LocFlyOverText="标记射击"

[BattleScanner X2WeaponTemplate]
FriendlyName="战术扫描仪"
FriendlyNamePlural="战术扫描仪"
BriefSummary="战术扫描仪为战场提供了额外的视野。士兵们把它像手榴弹一样展开，把它扔到地图上他们想要显示的隐藏区域。任何隐藏或伪装的敌人会被发现."
TacticalText="<Bullet/>战术扫描仪显示了一个隐藏的区域\"fog of war\"数个回合.\n<Bullet/>战术扫描仪还可以显示隐藏或伪装的敌人."
AbilityDescName="霰弹枪"

[ClausMecShotgun_CV_Schematic X2SchematicTemplate]
m_strClassLabel="游侠"
